package lesson3;

public class Task4 {
  public static void main(String [] args)
  {
	  //Вывести все цифры в обратном порядке на экран с использованием цикла for
	  for (int i = 5; i <= 11; i++)
		{
			System.out.println(i);
		}
	  
	  System.out.println();
	  
	  
	  for (int i = 11; i >=5; i--)
		{
			System.out.println(i);
		}
  }
}
